DataProcessors/КанбанДоска.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>КанбанДоска</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Таблица_Новое</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КатегорииОбращений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тема</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приоритет</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Приоритет</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СсылкаНаОбращение</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ОбращенияВПоддержку</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КаналПоступления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КаналыПоступления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыЗаявок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяРеакции</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяРешения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Таблица_КВыполнению</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КатегорииОбращений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тема</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приоритет</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Приоритет</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СсылкаНаОбращение</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ОбращенияВПоддержку</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Таблица_ВРаботе</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КатегорииОбращений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тема</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приоритет</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Приоритет</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СсылкаНаОбращение</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ОбращенияВПоддержку</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Таблица_ВОжидании</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КатегорииОбращений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тема</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приоритет</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Приоритет</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СсылкаНаОбращение</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ОбращенияВПоддержку</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Таблица_Выполнено</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КатегорииОбращений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тема</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приоритет</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Приоритет</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СсылкаНаОбращение</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ОбращенияВПоддержку</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/СтатусыЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЗаявок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КВыполнению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОжидании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ОбращенияВПоддержку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ОбращенияВПоддержку</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РегистрНакопления</xr:Item>
				<xr:Item>InformationRegister.ИсторияИзмененийОбращений</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаналПоступления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КаналыПоступления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииОбращений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Приоритет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяРеакцииФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяРешенияФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОбращения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тональность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоНазначениеОтветственного</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринятьДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РешитьДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяРеакцииРегламент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяРешенияРегламент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсторияСообщений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаВремя</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/КанбанДоска/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)    ОбновитьДанные();КонецПроцедуры&НаСервереПроцедура ОбновитьДанные()    Запрос = Новый Запрос("ВЫБРАТЬ
                          |	ОбращенияВПоддержку.Номер КАК Номер,
                          |	ОбращенияВПоддержку.Тема КАК Тема,
                          |	ОбращенияВПоддержку.Ответственный КАК Ответственный,
                          |	ОбращенияВПоддержку.Категория КАК Категория,
                          |	ОбращенияВПоддержку.Приоритет КАК Приоритет,
                          |	ОбращенияВПоддержку.Статус КАК Статус,
                          |	ОбращенияВПоддержку.Ссылка КАК Ссылка
                          |ИЗ
                          |	Документ.ОбращенияВПоддержку КАК ОбращенияВПоддержку");	
	Таблица_Новое = Объект.Таблица_Новое;  
	Таблица_КВыполнению = Объект.Таблица_КВыполнению;
	Таблица_ВРаботе = Объект.Таблица_ВРаботе;
	Таблица_ВОжидании = Объект.Таблица_ВОжидании;
	Таблица_Выполнено = Объект.Таблица_Выполнено;
	
	Таблица_Новое.Очистить();
	Таблица_КВыполнению.Очистить();
	Таблица_ВРаботе.Очистить();
	Таблица_ВОжидании.Очистить();
	Таблица_Выполнено.Очистить();
	    Результат = Запрос.Выполнить();    Выборка = Результат.Выбрать();    	Пока Выборка.Следующий() Цикл         
		Если Выборка.Статус = Перечисления.СтатусыЗаявок.Новое Тогда
			НоваяСтрока = Таблица_Новое.Добавить();
		ИначеЕсли Выборка.Статус = Перечисления.СтатусыЗаявок.КВыполнению Тогда
			НоваяСтрока = Таблица_КВыполнению.Добавить();  
		ИначеЕсли Выборка.Статус = Перечисления.СтатусыЗаявок.ВОжидании Тогда
			НоваяСтрока = Таблица_ВОжидании.Добавить();
		ИначеЕсли Выборка.Статус = Перечисления.СтатусыЗаявок.ВРаботе Тогда
			НоваяСтрока = Таблица_ВРаботе.Добавить();
		ИначеЕсли Выборка.Статус = Перечисления.СтатусыЗаявок.Выполнено Тогда
			НоваяСтрока = Таблица_Выполнено.Добавить(); 
		КонецЕсли;                     
		НоваяСтрока.Номер = Выборка.Номер;
		НоваяСтрока.Тема = Выборка.Тема;
		НоваяСтрока.Приоритет = Выборка.Приоритет;
		НоваяСтрока.Ответственный = Выборка.Ответственный;  
		НоваяСтрока.Категория = Выборка.Категория;
		НоваяСтрока.СсылкаНаОбращение = Выборка.Ссылка;    КонецЦикла;    КонецПроцедуры  

&НаКлиенте
Процедура ОбновитьСписок(Команда)
    ОбновитьДанные();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНовоеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	//Номер = Элемент.ТекущиеДанные.Номер;
	//НажатиеНаСтроку(Номер);	
	//ОбновитьДанные();
	СсылкаНаОбращение = Элемент.ТекущиеДанные.СсылкаНаОбращение;
    ОткрытьФормуПросмотра(СсылкаНаОбращение);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПросмотра(СсылкаНаОбращение)
	
	// В самой форме ФормаПросмотра нужно задать параметр с таким же именем "ПараметрФормыПросмотра" 
    ПараметрыФормы = Новый Структура("ПараметрФормыПросмотра", СсылкаНаОбращение);
    
    ОткрытьФорму("Обработка.ФормаПросмотраОбращенияОператора2.Форма.ФормаПросмотра",
				  ПараметрыФормы,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
    
КонецПроцедуры
   

&НаСервере
Процедура НажатиеНаСТрокуВниз(Номер)                     
	ВыбранныйНомер = Номер;
    ДокументОбъект = Документы.ОбращенияВПоддержку.НайтиПоНомеру(ВыбранныйНомер);
    
    Документ = ДокументОбъект.ПолучитьОбъект();
	
	ТекущийСтатус = Документ.Статус;
    НовыйСтатус = Перечисления.СтатусыЗаявок.Новое;
	
    Если ТекущийСтатус = Перечисления.СтатусыЗаявок.Новое Тогда
		НовыйСтатус = Перечисления.СтатусыЗаявок.КВыполнению;
	ИначеЕсли ТекущийСтатус = Перечисления.СтатусыЗаявок.КВыполнению Тогда
		НовыйСтатус = Перечисления.СтатусыЗаявок.ВРаботе;  
	ИначеЕсли ТекущийСтатус = Перечисления.СтатусыЗаявок.ВРаботе Тогда
		НовыйСтатус = Перечисления.СтатусыЗаявок.ВОжидании;
	ИначеЕсли ТекущийСтатус = Перечисления.СтатусыЗаявок.ВОжидании Тогда
		НовыйСтатус = Перечисления.СтатусыЗаявок.Выполнено;
	КонецЕсли; 	  
	
    Документ.Статус = НовыйСтатус;    
    Документ.Записать();
КонецПроцедуры 

&НаСервере
Процедура НажатиеНаСТрокуВверх(Номер)                     
	ВыбранныйНомер = Номер;
    ДокументОбъект = Документы.ОбращенияВПоддержку.НайтиПоНомеру(ВыбранныйНомер);
    
    Документ = ДокументОбъект.ПолучитьОбъект();
	
	ТекущийСтатус = Документ.Статус;
    НовыйСтатус = Перечисления.СтатусыЗаявок.Выполнено;
	
    Если ТекущийСтатус = Перечисления.СтатусыЗаявок.КВыполнению Тогда
		НовыйСтатус = Перечисления.СтатусыЗаявок.Новое;  
	ИначеЕсли ТекущийСтатус = Перечисления.СтатусыЗаявок.ВРаботе Тогда
		НовыйСтатус = Перечисления.СтатусыЗаявок.КВыполнению;
	ИначеЕсли ТекущийСтатус = Перечисления.СтатусыЗаявок.ВОжидании Тогда
		НовыйСтатус = Перечисления.СтатусыЗаявок.ВРаботе; 
	ИначеЕсли ТекущийСтатус = Перечисления.СтатусыЗаявок.Выполнено Тогда
		НовыйСтатус = Перечисления.СтатусыЗаявок.ВОжидании;
	КонецЕсли; 	  
	
    Документ.Статус = НовыйСтатус;    
    Документ.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВОжиданииВверх(Команда)
	ТекущиеДанные = ЭтаФорма.Элементы.ТаблицаВОжидании.ТекущиеДанные;	
	Номер = ТекущиеДанные.Номер;
	НажатиеНаСТрокуВверх(Номер);	
	ОбновитьДанные();
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВОжиданииВниз(Команда)
	ТекущиеДанные = ЭтаФорма.Элементы.ТаблицаВОжидании.ТекущиеДанные;	
	Номер = ТекущиеДанные.Номер;
	НажатиеНаСТрокуВниз(Номер);	
	ОбновитьДанные();
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВРаботеВверх(Команда)
	ТекущиеДанные = ЭтаФорма.Элементы.ТаблицаВРаботе.ТекущиеДанные;	
	Номер = ТекущиеДанные.Номер;
	НажатиеНаСТрокуВверх(Номер);	
	ОбновитьДанные();
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВРаботеВниз(Команда)
	ТекущиеДанные = ЭтаФорма.Элементы.ТаблицаВРаботе.ТекущиеДанные;	
	Номер = ТекущиеДанные.Номер;
	НажатиеНаСТрокуВниз(Номер);	
	ОбновитьДанные();
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВыполненоВверх(Команда)
	ТекущиеДанные = ЭтаФорма.Элементы.ТаблицаВыполнено.ТекущиеДанные;	
	Номер = ТекущиеДанные.Номер;
	НажатиеНаСТрокуВверх(Номер);	
	ОбновитьДанные();
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВыполненоВниз(Команда)
	ТекущиеДанные = ЭтаФорма.Элементы.ТаблицаВыполнено.ТекущиеДанные;	
	Номер = ТекущиеДанные.Номер;
	НажатиеНаСТрокуВниз(Номер);	
	ОбновитьДанные();
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиКВыполнениюВверх(Команда)
	ТекущиеДанные = ЭтаФорма.Элементы.ТаблицаКВыполнению.ТекущиеДанные;	
	Номер = ТекущиеДанные.Номер;
	НажатиеНаСТрокуВверх(Номер);	
	ОбновитьДанные();
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиКВыполнениюВниз(Команда)
	ТекущиеДанные = ЭтаФорма.Элементы.ТаблицаКВыполнению.ТекущиеДанные;	
	Номер = ТекущиеДанные.Номер;
	НажатиеНаСТрокуВниз(Номер);	
	ОбновитьДанные();
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиНовоеВверх(Команда)
    ТекущиеДанные = ЭтаФорма.Элементы.ТаблицаНовое.ТекущиеДанные;	
	Номер = ТекущиеДанные.Номер;
	НажатиеНаСТрокуВверх(Номер);	
	ОбновитьДанные();
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиНовоеВниз(Команда)
	ТекущиеДанные = ЭтаФорма.Элементы.ТаблицаНовое.ТекущиеДанные;	
	Номер = ТекущиеДанные.Номер;
	НажатиеНаСТрокуВниз(Номер);	
	ОбновитьДанные();
КонецПроцедуры
